          IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-CONSOLE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
          01 MSG PIC X(13) VALUE 'HELLO, WORLD!'.

       PROCEDURE DIVISION.
           DISPLAY MSG.
           STOP RUN.

